{
    "aboutMeData": {
        "intro": "Hi, I'm Johan",
        "opening": "This is my portfolio site! I'm an aspiring software engineer and currently in college. I'm within the last few semesters of my college career so I'm preparing for the real world soon.",
        "body": "I've had a portfolio site before, but it ended up being very complicated and was messy to maintain. This one has been very simple in contrast and coding this has been incredibly fun. I'm an aspiring software engineer currently in college, and I'm constantly looking for something to do in order to keep learning! I've gotten experience in both the frontend and backend sides of development and I'm hoping to get a role as a software engineer to go deep into these technologies",
        "closing": "If you want to check out my LinkedIn and Github, the icons on the left will lead to my profiles! Feel free to send me any feedback on my projects or connect on LinkedIn!"
    },
    "experienceData": [
        {
            "name": "Software Engineer Intern",
            "date": "May 2023 - August 2023",
            "company": "NI",
            "description": "As a software engineer intern, I was tasked with creating a desktop application that would give the user different options to launch another another application with specific configurations. This application is a popular software used by many of the company's customers and provides a way to better streamline user experience. Throughout my internship, I attended regular standups, had weekly meetings with my mentor and supervisor, as well as created documentation outlining my design, approach, and discoveries that would be helpful for anyone picking up the project wherever I left off.",
            "impact":"I created a piece of software that would end up being used for many of the company's customers. Within a few weeks of my internship, I was able to create a prototype and spent the majority of my time at NI implementing features and implemented some UI. I communicated with many different teams across the company and presneting demos to these teams and even the Product Manager for the team I worked with. It was an amazing experience knowing that I started work on software that would end up being used by many people and it was a huge motivator for my work.",
            "skills": "C#, Azure DevOps, WPF, Visual Studio"
        }
    ],
    "projectsData": [
        {
            "name": "AplCore",
            "date": "March 2024 - Current",
            "status": "Current Project",
            "description": "As sort of comical idea with the state of the current job market, this project is made as a way for a user to keep track of their job applications. It would be more user managed with them needing to update details on their own, but the aim is to make it much more manageable and easy compared to using something like Excel or Google Sheets. At this point, the project can easily expand to have other features.",
            "skills": "Backend Development, Frontend Development, Rust, React, MongoDB",
            "link": "https://github.com/Jolvera2001/AplCore",
            "linkDesc": "No current link or deployment, but the codebase is available to view on my Github!"
        },
        {
            "name": "GoatPlaces",
            "date": "August 2023 - March 2024",
            "status": "Shelved",
            "description": "This project was my senior project where I worked with two others. I was mainly focused on developing the backend and this was an incredibly rough project. The reasons included team coordination, discussions, lacking knowledge, etc, but in the end, we were able to get something going. After our presentation and shelving this project, I'm continuously thinking on different ways to improve this project if we ever work on it again. I'm hoping to get far with this project someday.",
            "skills": "Backend Development, RESTful APIs, ASP.NET Core, C#, MongoDB, JWTs, Microsoft Azure",
            "link": "https://github.com/Jolvera2001/goatApp",
            "linkDesc": "The Current deployment on Azure is broken, but the codebase is also available in Github"
        },
        {
            "name": "Room World",
            "date": "Feburary 2024 - March 2024",
            "status": "Shelved",
            "description": "This was more of a experimental project working with SingalR and websockets. It also introduced me to Typescript in React, which was incredibly difficult. I also used a 3D engine library and was aiming to use all of these to sort of make a game where one player can join another in a 'room' and sort of interact with each other in real time. I've only gotten as far as generating another player model within one's screen so I know I'm almost there with achieving somehing to show off.",
            "skills": "Backend Development, ASP.NET Core, SignalR, C#, React",
            "link": "https://github.com/Jolvera2001/Room-world",
            "linkDesc": "The Codebase is available on Github!"
        }
    ],
    "hobbiesData": [
        {
            "hobby": "Leather Craft",
            "description": "Leather craft was something I didn't really expect to get into, but one day I got a small craft kit for making a wallet and once I finished it was an amazing feeling. Afterwards, I ended up doing tons of research over what sort of thigns you can do with leather craft. In the end, I ended up learning a bit about leather maintenance with conditioners and waxes, as well as transferable skills like sewing in general.",
            "plans": "I haven't had to chance to do much more than a few other kits throughout my college career and leather is pricey, but in the future, I do plan on getting more involved in creating designs and seeing if I can end up selling some of the things I make. For now though, I can't really do much."
        },
        {
            "hobby": "Video Games",
            "description": "This has been a very huge part of my life, and although I haven't been playing as much as I did in the past, I do end up taking some evenings just to play some video games to relax. I've played a lot of different games: strategy, FPS, 3rd Person, etc.",
            "plans": "One thing I've thought about since I do know programming is maybe creating my own game, but barriers like art (ESPECIALLY ART) takes time to learn and implement and so much more to get down correctly. Music wouldn't be too hard since I've had a big background in music, it would just be a matter of relearning concepts and experimenting."
        }
    ]
}